{"cells":[{"cell_type":"markdown","metadata":{"id":"gnfClx7-FfjU"},"source":["<div>\n","<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width=\"300\">\n","</div>"]},{"cell_type":"markdown","metadata":{"id":"_shYCClxFfjX"},"source":["# Lab 3.1.5\n","# *Neo4j and Python*"]},{"cell_type":"markdown","metadata":{"id":"pDJmT5Y5Ffja"},"source":["## Introduction\n","\n","Neo4j is the most popular graph database. Free versions include the Desktop (Developer) edition and the Community Server edition (which we can drive from Python).\n","\n","We will begin this lab by working through the tutorial embedded in the Neo4j *start* page to learn about graph databases structures and the Cypher query language. We will then see how to integrate a Neo4j database with a Python program."]},{"cell_type":"markdown","metadata":{"id":"--O6XzsrFfjc"},"source":["The Community Server version can be downloaded here: https://neo4j.com/deployment-center/#releases\n","* Link for additional assistance: [How To Neo4j Community Install On Windows 2019 Server For External Access](https://www.youtube.com/watch?v=JaWGwnPkOYA&t=105s)\n","\n","If installation here is unsuccessful try the Desktop edition: https://neo4j.com/download/\n","* Link for additional assistance: [Neo4j (Graph Database) Crash Course](https://www.youtube.com/watch?v=8jNPelugC2s&t=597s)"]},{"cell_type":"markdown","metadata":{"id":"iLovaF_hFfje"},"source":["- Go through the *Concepts* tutorial.\n","- At the end, click *Intro* under *Keep getting started* heading and go through the tutorial.\n","- At the end, click *Cypher* under *Keep getting started* heading and go through the tutorial.\n","- At the end, click *The Movie Graph* under *Jump into code* heading and go through the tutorial.\n"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"s5eoX0srJsvC"},"outputs":[],"source":["#### (If you are using community)Add instruction to create/connect/start the database from neo4j localhost browser, otherwise your query won't work"]},{"cell_type":"markdown","metadata":{"id":"hpo-lWuhFfjg"},"source":["## Driving Neo4j from Python\n","\n","There are a variety of Python libraries for Neo4j, some of which provide more compact (and simpler) ways of executing commands. To avoid having to learn too many different ways of doing the same thing, however, we will use the official one, which is based on the syntax of the Cypher query language."]},{"cell_type":"markdown","metadata":{"id":"9KKFMPT4Ffjh"},"source":["The ***Neo4j Bolt Driver for Python*** is documented at https://neo4j.com/docs/api/python-driver/current/."]},{"cell_type":"code","execution_count":null,"metadata":{"id":"ow-A7jAEJsvD"},"outputs":[],"source":["#!pip install neo4j"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"XbFzjBvUJsvE"},"outputs":[],"source":["# After a while if you want to use neo4j, you can use this local browser link to log in\n","# http://localhost:7474/browser/"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"HAhDdXNsFfji"},"outputs":[],"source":["#from neo4j.v1 import GraphDatabase\n","from neo4j import GraphDatabase\n","\n","#uri = \"bolt://localhost:7687\" ----> This should also work\n","uri = \"neo4j://localhost:7687\"\n","\n","username = \"neo4j\"\n","password = \"SuperPassword\" #----> your default password might not work in the first try, so you should change your password\n","\n","# How to change Neo4j default password?\n","# After going to localhost:7474 in your browser, you will be prompted to log in.\n","# Use the default login info:\n","    # User: neo4j\n","    # Password: neo4j\n","# You’ll then be asked to change your password."]},{"cell_type":"code","execution_count":null,"metadata":{"id":"0OvOtl7tFfjm"},"outputs":[],"source":["driver = GraphDatabase.driver(uri, auth=(username, password))"]},{"cell_type":"markdown","metadata":{"id":"GYF3MCsMFfjq"},"source":["To execute a query against a database using this driver, we need to wrap the Cypher query string in a function definition and pass the function to the `read_transaction` method of the `session` object. Our query function then has access to the `tx` object.\n","\n","Here is a function that finds all the movies that the requested `Person` acted in:"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"K3q7Wl8yFfjs"},"outputs":[],"source":["def print_movies_by(tx, name):\n","    for record in tx.run(\"MATCH (a:Person)-[:ACTED_IN]->(anyMovies) \"\n","                         \"WHERE a.name = $name \"\n","                         \"RETURN anyMovies\", name = name):\n","        print(record[\"anyMovies\"])"]},{"cell_type":"markdown","metadata":{"id":"ctqGDOhDJsvF"},"source":["**Note**: For the following queries to work the Movie Graph database should have been loaded with your Neo4j program."]},{"cell_type":"markdown","metadata":{"id":"MTNO6Y6eFfjx"},"source":["Here is how to use it to list Tom Hanks' movies:"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"eQTlrnveFfjy","outputId":"b9b91594-349c-4964-b20f-f94681e9a557"},"outputs":[{"name":"stdout","output_type":"stream","text":["<Node element_id='4:8ac45bf2-ab8d-4c4a-bb5b-6cb557f63360:144' labels=frozenset({'Movie'}) properties={'tagline': 'Houston, we have a problem.', 'title': 'Apollo 13', 'released': 1995}>\n","<Node element_id='4:8ac45bf2-ab8d-4c4a-bb5b-6cb557f63360:67' labels=frozenset({'Movie'}) properties={'tagline': 'At odds in life... in love on-line.', 'title': \"You've Got Mail\", 'released': 1998}>\n","<Node element_id='4:8ac45bf2-ab8d-4c4a-bb5b-6cb557f63360:162' labels=frozenset({'Movie'}) properties={'tagline': 'Once in a lifetime you get a chance to do something different.', 'title': 'A League of Their Own', 'released': 1992}>\n","<Node element_id='4:8ac45bf2-ab8d-4c4a-bb5b-6cb557f63360:78' labels=frozenset({'Movie'}) properties={'tagline': 'A story of love, lava and burning desire.', 'title': 'Joe Versus the Volcano', 'released': 1990}>\n","<Node element_id='4:8ac45bf2-ab8d-4c4a-bb5b-6cb557f63360:85' labels=frozenset({'Movie'}) properties={'tagline': 'In every life there comes a time when that thing you dream becomes that thing you do', 'title': 'That Thing You Do', 'released': 1996}>\n","<Node element_id='4:8ac45bf2-ab8d-4c4a-bb5b-6cb557f63360:111' labels=frozenset({'Movie'}) properties={'tagline': 'Break The Codes', 'title': 'The Da Vinci Code', 'released': 2006}>\n","<Node element_id='4:8ac45bf2-ab8d-4c4a-bb5b-6cb557f63360:105' labels=frozenset({'Movie'}) properties={'tagline': 'Everything is connected', 'title': 'Cloud Atlas', 'released': 2012}>\n","<Node element_id='4:8ac45bf2-ab8d-4c4a-bb5b-6cb557f63360:150' labels=frozenset({'Movie'}) properties={'tagline': 'At the edge of the world, his journey begins.', 'title': 'Cast Away', 'released': 2000}>\n","<Node element_id='4:8ac45bf2-ab8d-4c4a-bb5b-6cb557f63360:130' labels=frozenset({'Movie'}) properties={'tagline': \"Walk a mile you'll never forget.\", 'title': 'The Green Mile', 'released': 1999}>\n","<Node element_id='4:8ac45bf2-ab8d-4c4a-bb5b-6cb557f63360:73' labels=frozenset({'Movie'}) properties={'tagline': 'What if someone you never met, someone you never saw, someone you never knew was the only someone for you?', 'title': 'Sleepless in Seattle', 'released': 1993}>\n","<Node element_id='4:8ac45bf2-ab8d-4c4a-bb5b-6cb557f63360:161' labels=frozenset({'Movie'}) properties={'tagline': 'This Holiday Season... Believe', 'title': 'The Polar Express', 'released': 2004}>\n","<Node element_id='4:8ac45bf2-ab8d-4c4a-bb5b-6cb557f63360:159' labels=frozenset({'Movie'}) properties={'tagline': \"A stiff drink. A little mascara. A lot of nerve. Who said they couldn't bring down the Soviet empire.\", 'title': \"Charlie Wilson's War\", 'released': 2007}>\n"]}],"source":["with driver.session() as session:\n","    session.execute_read(print_movies_by, \"Tom Hanks\")"]},{"cell_type":"markdown","metadata":{"id":"QDEBcR_5Ffj1"},"source":["Clearly, some further wrangling is required to produce neat output. (Read the documentation before you attempt this.)"]},{"cell_type":"markdown","metadata":{"id":"joJo0-GmFfj1"},"source":["In fact, both the method of using the Neo4j Bolt Driver and the data returned by it are unwieldy. This is typical of low-level drivers."]},{"cell_type":"markdown","metadata":{"id":"bG--AtaEFfj2"},"source":["Try building and running some more queries based on the code in examples queries in The Movie Graph tutorial."]},{"cell_type":"code","execution_count":null,"metadata":{"id":"nRwSA0c-JsvG","outputId":"89c3c548-19ca-4793-de3e-da8d71ae8269"},"outputs":[{"name":"stdout","output_type":"stream","text":["Title: Apollo 13\n","Tagline: Houston, we have a problem.\n","Released: 1995\n","==================================================\n","Title: You've Got Mail\n","Tagline: At odds in life... in love on-line.\n","Released: 1998\n","==================================================\n","Title: A League of Their Own\n","Tagline: Once in a lifetime you get a chance to do something different.\n","Released: 1992\n","==================================================\n","Title: Joe Versus the Volcano\n","Tagline: A story of love, lava and burning desire.\n","Released: 1990\n","==================================================\n","Title: That Thing You Do\n","Tagline: In every life there comes a time when that thing you dream becomes that thing you do\n","Released: 1996\n","==================================================\n","Title: The Da Vinci Code\n","Tagline: Break The Codes\n","Released: 2006\n","==================================================\n","Title: Cloud Atlas\n","Tagline: Everything is connected\n","Released: 2012\n","==================================================\n","Title: Cast Away\n","Tagline: At the edge of the world, his journey begins.\n","Released: 2000\n","==================================================\n","Title: The Green Mile\n","Tagline: Walk a mile you'll never forget.\n","Released: 1999\n","==================================================\n","Title: Sleepless in Seattle\n","Tagline: What if someone you never met, someone you never saw, someone you never knew was the only someone for you?\n","Released: 1993\n","==================================================\n","Title: The Polar Express\n","Tagline: This Holiday Season... Believe\n","Released: 2004\n","==================================================\n","Title: Charlie Wilson's War\n","Tagline: A stiff drink. A little mascara. A lot of nerve. Who said they couldn't bring down the Soviet empire.\n","Released: 2007\n","==================================================\n"]}],"source":["# Prints a more readable output\n","def print_movies_by(tx, name):\n","    for record in tx.run(\"MATCH (a:Person)-[:ACTED_IN]->(movie:Movie) \"\n","                         \"WHERE a.name = $name \"\n","                         \"RETURN movie.title AS title, movie.tagline AS tagline, movie.released AS released\", name=name):\n","        title = record[\"title\"]\n","        tagline = record[\"tagline\"]\n","        released = record[\"released\"]\n","        print(f\"Title: {title}\")\n","        print(f\"Tagline: {tagline}\")\n","        print(f\"Released: {released}\")\n","        print(\"=\" * 50)\n","\n","with driver.session() as session:\n","    session.execute_read(print_movies_by, \"Tom Hanks\")\n"]},{"cell_type":"markdown","metadata":{"id":"zNKuZdZbJsvG"},"source":["## 1. Find actors who have acted in more than a certain number of movies:"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"2klM4GSWJsvH"},"outputs":[],"source":["def find_actors_with_movies(tx, threshold):\n","    query = (\n","        \"MATCH (a:Person)-[:ACTED_IN]->(m:Movie) \"\n","        \"WITH a, count(m) AS movieCount \"\n","        \"WHERE movieCount > $threshold \"\n","        \"RETURN a.name AS actorName, movieCount\"\n","    )\n","    result = tx.run(query, threshold=threshold)\n","    for record in result:\n","        print(record[\"actorName\"], \"acted in\", record[\"movieCount\"], \"movies\")\n"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"s81njYo0JsvH","outputId":"d4b72d0d-dd96-4b9e-bf25-73e33ca372b9"},"outputs":[{"name":"stdout","output_type":"stream","text":["Keanu Reeves acted in 7 movies\n","Tom Hanks acted in 12 movies\n"]}],"source":["# Usage:\n","driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(username, password))\n","with driver.session() as session:\n","    session.execute_read(find_actors_with_movies, threshold=5)"]},{"cell_type":"markdown","metadata":{"id":"a24nY6dnJsvH"},"source":["## 2. Identify co-actors of a specific actor (Bonus: Return the output in a nice tabular format):"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"10VjwYmxJsvH"},"outputs":[],"source":["def find_co_actors(tx, actor_name):\n","    query = (\n","        \"MATCH (a1:Person)-[:ACTED_IN]->(m:Movie)<-[:ACTED_IN]-(a2:Person) \"\n","        \"WHERE a1.name = $actorName \"\n","        \"RETURN a2.name AS coActorName, collect(m.title) AS movies\"\n","    )\n","    result = tx.run(query, actorName=actor_name)\n","    data = [(record[\"coActorName\"], \", \".join(record[\"movies\"])) for record in result]\n","    return data"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"9yIqbX4AJsvH","outputId":"8e11f93f-ae11-4cb0-a9d0-1b1e91806d68"},"outputs":[{"name":"stdout","output_type":"stream","text":["Co-Actor Name           Movies\n","----------------------  -------------------------------------------------------------\n","Ed Harris               Apollo 13\n","Gary Sinise             Apollo 13, The Green Mile\n","Kevin Bacon             Apollo 13\n","Bill Paxton             Apollo 13, A League of Their Own\n","Parker Posey            You've Got Mail\n","Greg Kinnear            You've Got Mail\n","Meg Ryan                You've Got Mail, Joe Versus the Volcano, Sleepless in Seattle\n","Steve Zahn              You've Got Mail\n","Dave Chappelle          You've Got Mail\n","Madonna                 A League of Their Own\n","Rosie O'Donnell         A League of Their Own, Sleepless in Seattle\n","Geena Davis             A League of Their Own\n","Lori Petty              A League of Their Own\n","Nathan Lane             Joe Versus the Volcano\n","Liv Tyler               That Thing You Do\n","Charlize Theron         That Thing You Do\n","Ian McKellen            The Da Vinci Code\n","Audrey Tautou           The Da Vinci Code\n","Paul Bettany            The Da Vinci Code\n","Jim Broadbent           Cloud Atlas\n","Halle Berry             Cloud Atlas\n","Hugo Weaving            Cloud Atlas\n","Helen Hunt              Cast Away\n","Sam Rockwell            The Green Mile\n","Bonnie Hunt             The Green Mile\n","Patricia Clarkson       The Green Mile\n","James Cromwell          The Green Mile\n","Michael Clarke Duncan   The Green Mile\n","David Morse             The Green Mile\n","Victor Garber           Sleepless in Seattle\n","Bill Pullman            Sleepless in Seattle\n","Rita Wilson             Sleepless in Seattle\n","Julia Roberts           Charlie Wilson's War\n","Philip Seymour Hoffman  Charlie Wilson's War\n"]}],"source":["from tabulate import tabulate\n","# Usage:\n","# driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(username, password))\n","with driver.session() as session:\n","    data = session.execute_read(find_co_actors, actor_name=\"Tom Hanks\")\n","\n","print(tabulate(data, headers=[\"Co-Actor Name\", \"Movies\"]))\n"]},{"cell_type":"markdown","metadata":{"id":"__zJbCjeJsvI"},"source":["## 3. Find movies released after a certain year:"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"cgpVDPRhJsvI"},"outputs":[],"source":["def find_movies_after_year(tx, year):\n","    query = (\n","        \"MATCH (m:Movie) \"\n","        \"WHERE m.released > $year \"\n","        \"RETURN m.title AS movieTitle, m.released AS releaseYear\"\n","    )\n","    result = tx.run(query, year=year)\n","    for record in result:\n","        print(record[\"movieTitle\"], \"was released in\", record[\"releaseYear\"])\n"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"8yKixGkdJsvI","outputId":"ee4c2eff-5225-4ca1-eefd-aa79a5b6e2f7"},"outputs":[{"name":"stdout","output_type":"stream","text":["The Matrix Reloaded was released in 2003\n","The Matrix Revolutions was released in 2003\n","Something's Gotta Give was released in 2003\n","The Polar Express was released in 2004\n","RescueDawn was released in 2006\n","The Da Vinci Code was released in 2006\n","V for Vendetta was released in 2006\n","Charlie Wilson's War was released in 2007\n","Speed Racer was released in 2008\n","Frost/Nixon was released in 2008\n","Ninja Assassin was released in 2009\n","Cloud Atlas was released in 2012\n"]}],"source":["# Usage:\n","#driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"password\"))\n","with driver.session() as session:\n","    session.execute_read(find_movies_after_year, year=2000)"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"ssYkH2O3JsvI","outputId":"aef43a89-73b5-4a13-b15d-7a01b55069a4"},"outputs":[{"name":"stdout","output_type":"stream","text":["Printing movies in original format:\n","The Matrix Reloaded was released in 2003\n","The Matrix Revolutions was released in 2003\n","Something's Gotta Give was released in 2003\n","The Polar Express was released in 2004\n","RescueDawn was released in 2006\n","The Da Vinci Code was released in 2006\n","V for Vendetta was released in 2006\n","Charlie Wilson's War was released in 2007\n","Speed Racer was released in 2008\n","Frost/Nixon was released in 2008\n","Ninja Assassin was released in 2009\n","Cloud Atlas was released in 2012\n","\n","Printing movies in tabular format:\n","Movie Title               Release Year\n","----------------------  --------------\n","The Matrix Reloaded               2003\n","The Matrix Revolutions            2003\n","Something's Gotta Give            2003\n","The Polar Express                 2004\n","RescueDawn                        2006\n","The Da Vinci Code                 2006\n","V for Vendetta                    2006\n","Charlie Wilson's War              2007\n","Speed Racer                       2008\n","Frost/Nixon                       2008\n","Ninja Assassin                    2009\n","Cloud Atlas                       2012\n"]}],"source":["# ALTERNATIVE ANSWER:\n","def find_movies_after_year(tx, year):\n","    query = (\n","        \"MATCH (m:Movie) \"\n","        \"WHERE m.released > $year \"\n","        \"RETURN m.title AS movieTitle, m.released AS releaseYear\"\n","    )\n","    result = tx.run(query, year=year)\n","    data = [(record[\"movieTitle\"], record[\"releaseYear\"]) for record in result]\n","    return data\n","\n","def print_movies(data):\n","    for movie, year in data:\n","        print(movie, \"was released in\", year)\n","\n","def print_movies_tabular(data):\n","    print(tabulate(data, headers=[\"Movie Title\", \"Release Year\"]))\n","\n","# Usage:\n","driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth =(username, password))\n","with driver.session() as session:\n","    data = session.execute_read(find_movies_after_year, year=2000)\n","\n","    print(\"Printing movies in original format:\")\n","    print_movies(data)\n","\n","    print(\"\\nPrinting movies in tabular format:\")\n","    print_movies_tabular(data)\n"]},{"cell_type":"markdown","metadata":{"id":"o4xkhuKoJsvI"},"source":["## 4. Find movies in a particular genre:"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"j3Bnr7dqJsvJ"},"outputs":[],"source":["def find_movies_in_genre(tx, genre):\n","    query = (\n","        \"MATCH (m:Movie)-[:IN_GENRE]->(g:Genre) \"\n","        \"WHERE g.name = $genre \"\n","        \"RETURN m.title AS movieTitle\"\n","    )\n","    result = tx.run(query, genre=genre)\n","    for record in result:\n","        print(record[\"movieTitle\"], \"is in the\", genre, \"genre\")"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"KWk3jIVQJsvK"},"outputs":[],"source":["# Usage:\n","driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(username, password))\n","with driver.session() as session:\n","    session.execute_read(find_movies_in_genre, genre=\"Action\")"]},{"cell_type":"markdown","metadata":{"id":"_Z7TpiViJsvK"},"source":["## 5. Find movies directed by a specific director:"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"KTdMKylHJsvK"},"outputs":[],"source":["def find_movies_by_director(tx, director):\n","    query = (\n","        \"MATCH (d:Person)-[:DIRECTED]->(m:Movie) \"\n","        \"WHERE d.name = $director \"\n","        \"RETURN m.title AS movieTitle\"\n","    )\n","    result = tx.run(query, director=director)\n","    for record in result:\n","        print(record[\"movieTitle\"], \"was directed by\", director)"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"BQ_DQhexJsvK"},"outputs":[],"source":["# Usage:\n","#driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"password\"))\n","with driver.session() as session:\n","    session.execute_read(find_movies_by_director, director=\"Steven Spielberg\")"]},{"cell_type":"markdown","metadata":{"id":"MnReL3zVJsvK"},"source":["## 6. Find movies where a specific actor both acted in and directed:"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"bWKiNPhBJsvK"},"outputs":[],"source":["def find_movies_actor_directed(tx, actor_name):\n","    query = (\n","        \"MATCH (a:Person)-[:ACTED_IN]->(m:Movie)<-[:DIRECTED]-(a) \"\n","        \"WHERE a.name = $actorName \"\n","        \"RETURN m.title AS movieTitle\"\n","    )\n","    result = tx.run(query, actorName=actor_name)\n","    for record in result:\n","\n","        print(actor_name, \"acted in and directed\", record[\"movieTitle\"])"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"ER6K15sUJsvL","outputId":"f832a9dd-847c-4e28-b543-2947737de015"},"outputs":[{"name":"stdout","output_type":"stream","text":["Tom Hanks acted in and directed That Thing You Do\n"]}],"source":["# Usage:\n","#driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"password\"))\n","with driver.session() as session:\n","    session.execute_read(find_movies_actor_directed, actor_name=\"Tom Hanks\")"]},{"cell_type":"markdown","metadata":{"id":"NKcWHJZCJsvL"},"source":["## 7. Find actors who have worked in a specific genre:"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"PKEwJrxnJsvL"},"outputs":[],"source":["def find_actors_in_genre(tx, genre):\n","    query = (\n","        \"MATCH (a:Person)-[:ACTED_IN]->(:Movie)-[:IN_GENRE]->(g:Genre) \"\n","        \"WHERE g.name = $genre \"\n","        \"RETURN DISTINCT a.name AS actorName\"\n","    )\n","    result = tx.run(query, genre=genre)\n","    for record in result:\n","        print(record[\"actorName\"], \"has worked in the\", genre, \"genre\")\n",""]},{"cell_type":"code","execution_count":null,"metadata":{"id":"LS25-COvJsvL"},"outputs":[],"source":["# Usage:\n","#driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"password\"))\n","with driver.session() as session:\n","    session.execute_read(find_actors_in_genre, genre=\"Comedy\")\n"]},{"cell_type":"code","execution_count":null,"metadata":{"id":"kaXi-OExFfj6"},"outputs":[],"source":["session.close()\n","driver.close()"]},{"cell_type":"markdown","metadata":{"id":"rtQEKZpkJsvL"},"source":["### Additional Reference\n","* [Build applications with Neo4j and Python](https://neo4j.com/docs/python-manual/current/)"]},{"cell_type":"markdown","metadata":{"id":"sNOPRB7rFfj9"},"source":["## - END -"]},{"cell_type":"markdown","metadata":{"id":"RERADKgNFq9T"},"source":["\n","\n","---\n","\n","\n","\n","---\n","\n","\n","\n","> > > > > > > > > © 2024 Institute of Data\n","\n","\n","---\n","\n","\n","\n","---\n","\n","\n","\n"]}],"metadata":{"colab":{"provenance":[]},"kernelspec":{"display_name":"Python 3 (ipykernel)","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.11.7"}},"nbformat":4,"nbformat_minor":0}